<template>
  <FormLayout
    class="addComplex"
    :title="titleForm"
    @closeModel="emits('closeModel')"
    :class="isOpen ? 'open' : ''"
  >
    <template v-slot:default>
      <form class="form addComplex__form">
        <MySelect
          label="Тип комплекса"
          v-model="newComplex.type"
          class="form__item"
        />
        <MyInput
          label="ID комплекса в базе Домклик"
          v-model="newComplex.idDomClick"
          nameField="idDomClick"
          placeholder="Введите ID"
        />
        <MySelect
          label="Страна"
          v-model="newComplex.country"
          class="form__item"
          :items="[]"
        />
        <MySelect
          label="Название субъекта РФ (регион)"
          v-model="newComplex.region"
          class="form__item"
          :items="[]"
        />
        <MyInput
          label="Адрес"
          v-model="newComplex.address"
          nameField="idDomClick"
          placeholder="Введите адрес"
        />
        <MySelect
          label="Метро"
          v-model="newComplex.metro"
          class="form__item"
          :items="[]"
        />
        <FormItemLayout label="Название комплекса">
          <MyCheckbox
            text="Выбрать из новостроек"
            @change="titleFromNewBuild = $event"
          />
        </FormItemLayout>
        <MyInput
          label="Название"
          v-model="newComplex.title"
          nameField="title"
          placeholder="Введите название"
        />
        <FormItemLayout label="Основное описание комплекса">
          <MyInput
            :withLabel="false"
            v-model="newComplex.title"
            nameField="title"
            placeholder="Заголовок описания"
          />
          <MyTextarea v-model="newComplex.title" placeholder="Описание" />
        </FormItemLayout>
        <FormItemLayout label="Второстепенное описание ЖК">
          <MyInput
            :withLabel="false"
            v-model="newComplex.title"
            nameField="title"
            placeholder="Заголовок описания"
          />
          <MyTextarea v-model="newComplex.title" placeholder="Описание" />
        </FormItemLayout>
        <MyInput
          label="Видео ЖК"
          v-model="newComplex.title"
          nameField="title"
          placeholder="Ссылка на видео"
        />
        <MySelect
          label="Тип видео"
          v-model="newComplex.region"
          class="form__item"
          :items="[]"
        />
        <FormItemLayout
          :label="index === 0 ? 'Главные УТП' : 'Второстепенные УТП'"
          v-for="(utp, index) in newComplex.uniqueOffer"
          :key="'utp' + index"
        >
          <div class="title">{{ utp.title }}</div>
          <div class="description">{{ utp.description }}</div>
          <div class="utp__btns">
            <MyButton class="utp__delete" @click.prevent="deleteUtp(index)">
              <svg
                width="18"
                height="18"
                viewBox="0 0 18 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M7.5 13.5C7.69891 13.5 7.88968 13.421 8.03033 13.2803C8.17098 13.1397 8.25 12.9489 8.25 12.75V8.25C8.25 8.05109 8.17098 7.86032 8.03033 7.71967C7.88968 7.57902 7.69891 7.5 7.5 7.5C7.30109 7.5 7.11032 7.57902 6.96967 7.71967C6.82902 7.86032 6.75 8.05109 6.75 8.25V12.75C6.75 12.9489 6.82902 13.1397 6.96967 13.2803C7.11032 13.421 7.30109 13.5 7.5 13.5ZM15 4.5H12V3.75C12 3.15326 11.7629 2.58097 11.341 2.15901C10.919 1.73705 10.3467 1.5 9.75 1.5H8.25C7.65326 1.5 7.08097 1.73705 6.65901 2.15901C6.23705 2.58097 6 3.15326 6 3.75V4.5H3C2.80109 4.5 2.61032 4.57902 2.46967 4.71967C2.32902 4.86032 2.25 5.05109 2.25 5.25C2.25 5.44891 2.32902 5.63968 2.46967 5.78033C2.61032 5.92098 2.80109 6 3 6H3.75V14.25C3.75 14.8467 3.98705 15.419 4.40901 15.841C4.83097 16.2629 5.40326 16.5 6 16.5H12C12.5967 16.5 13.169 16.2629 13.591 15.841C14.0129 15.419 14.25 14.8467 14.25 14.25V6H15C15.1989 6 15.3897 5.92098 15.5303 5.78033C15.671 5.63968 15.75 5.44891 15.75 5.25C15.75 5.05109 15.671 4.86032 15.5303 4.71967C15.3897 4.57902 15.1989 4.5 15 4.5ZM7.5 3.75C7.5 3.55109 7.57902 3.36032 7.71967 3.21967C7.86032 3.07902 8.05109 3 8.25 3H9.75C9.94891 3 10.1397 3.07902 10.2803 3.21967C10.421 3.36032 10.5 3.55109 10.5 3.75V4.5H7.5V3.75ZM12.75 14.25C12.75 14.4489 12.671 14.6397 12.5303 14.7803C12.3897 14.921 12.1989 15 12 15H6C5.80109 15 5.61032 14.921 5.46967 14.7803C5.32902 14.6397 5.25 14.4489 5.25 14.25V6H12.75V14.25ZM10.5 13.5C10.6989 13.5 10.8897 13.421 11.0303 13.2803C11.171 13.1397 11.25 12.9489 11.25 12.75V8.25C11.25 8.05109 11.171 7.86032 11.0303 7.71967C10.8897 7.57902 10.6989 7.5 10.5 7.5C10.3011 7.5 10.1103 7.57902 9.96967 7.71967C9.82902 7.86032 9.75 8.05109 9.75 8.25V12.75C9.75 12.9489 9.82902 13.1397 9.96967 13.2803C10.1103 13.421 10.3011 13.5 10.5 13.5Z"
                  fill="#666666"
                />
              </svg>
            </MyButton>
            <MyButton class="utp__edit" @click.prevent="editUtp(index)">
              <svg
                width="18"
                height="18"
                viewBox="0 0 18 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15.99 7.1625L14.5725 6.69L15.24 5.355C15.3077 5.21527 15.3303 5.05798 15.3048 4.90483C15.2793 4.75169 15.2068 4.61024 15.0975 4.5L13.5 2.9025C13.3892 2.79157 13.2464 2.71816 13.0917 2.6926C12.937 2.66704 12.7781 2.69061 12.6375 2.76L11.3025 3.4275L10.83 2.01C10.7801 1.86225 10.6854 1.73372 10.559 1.64231C10.4327 1.55091 10.281 1.50116 10.125 1.5H7.875C7.71777 1.4996 7.56439 1.54862 7.43653 1.64013C7.30868 1.73165 7.21282 1.86104 7.1625 2.01L6.69 3.4275L5.355 2.76C5.21527 2.69234 5.05798 2.66971 4.90483 2.69523C4.75169 2.72075 4.61024 2.79318 4.5 2.9025L2.9025 4.5C2.79157 4.61083 2.71816 4.75363 2.6926 4.90834C2.66704 5.06305 2.69061 5.22189 2.76 5.3625L3.4275 6.6975L2.01 7.17C1.86225 7.2199 1.73372 7.31462 1.64231 7.44098C1.55091 7.56734 1.50116 7.71905 1.5 7.875V10.125C1.4996 10.2822 1.54862 10.4356 1.64013 10.5635C1.73165 10.6913 1.86104 10.7872 2.01 10.8375L3.4275 11.31L2.76 12.645C2.69234 12.7847 2.66971 12.942 2.69523 13.0952C2.72075 13.2483 2.79318 13.3898 2.9025 13.5L4.5 15.0975C4.61083 15.2084 4.75363 15.2818 4.90834 15.3074C5.06305 15.333 5.22189 15.3094 5.3625 15.24L6.6975 14.5725L7.17 15.99C7.22032 16.139 7.31618 16.2684 7.44403 16.3599C7.57189 16.4514 7.72527 16.5004 7.8825 16.5H10.1325C10.2897 16.5004 10.4431 16.4514 10.571 16.3599C10.6988 16.2684 10.7947 16.139 10.845 15.99L11.3175 14.5725L12.6525 15.24C12.7913 15.306 12.9471 15.3277 13.0987 15.3022C13.2503 15.2767 13.3904 15.2052 13.5 15.0975L15.0975 13.5C15.2084 13.3892 15.2818 13.2464 15.3074 13.0917C15.333 12.937 15.3094 12.7781 15.24 12.6375L14.5725 11.3025L15.99 10.83C16.1378 10.7801 16.2663 10.6854 16.3577 10.559C16.4491 10.4327 16.4988 10.281 16.5 10.125V7.875C16.5004 7.71777 16.4514 7.56439 16.3599 7.43653C16.2684 7.30868 16.139 7.21282 15.99 7.1625ZM15 9.585L14.1 9.885C13.893 9.95213 13.7032 10.0635 13.5435 10.2113C13.3839 10.3592 13.2584 10.54 13.1756 10.7412C13.0928 10.9424 13.0548 11.1592 13.0642 11.3766C13.0736 11.594 13.1302 11.8067 13.23 12L13.6575 12.855L12.8325 13.68L12 13.23C11.8077 13.1342 11.597 13.0808 11.3822 13.0735C11.1675 13.0662 10.9537 13.1051 10.7552 13.1875C10.5568 13.27 10.3785 13.3942 10.2322 13.5516C10.0859 13.7091 9.9752 13.8961 9.9075 14.1L9.6075 15H8.415L8.115 14.1C8.04787 13.893 7.93652 13.7032 7.78868 13.5435C7.64083 13.3839 7.46003 13.2584 7.25882 13.1756C7.0576 13.0928 6.84079 13.0548 6.62342 13.0642C6.40605 13.0736 6.19333 13.1302 6 13.23L5.145 13.6575L4.32 12.8325L4.77 12C4.86982 11.8067 4.92639 11.594 4.93579 11.3766C4.94518 11.1592 4.90718 10.9424 4.82441 10.7412C4.74164 10.54 4.61609 10.3592 4.45646 10.2113C4.29684 10.0635 4.10696 9.95213 3.9 9.885L3 9.585V8.415L3.9 8.115C4.10696 8.04787 4.29684 7.93652 4.45646 7.78868C4.61609 7.64083 4.74164 7.46003 4.82441 7.25882C4.90718 7.0576 4.94518 6.84079 4.93579 6.62342C4.92639 6.40605 4.86982 6.19333 4.77 6L4.3425 5.1675L5.1675 4.3425L6 4.77C6.19333 4.86982 6.40605 4.92639 6.62342 4.93579C6.84079 4.94518 7.0576 4.90718 7.25882 4.82441C7.46003 4.74164 7.64083 4.61609 7.78868 4.45646C7.93652 4.29684 8.04787 4.10696 8.115 3.9L8.415 3H9.585L9.885 3.9C9.95213 4.10696 10.0635 4.29684 10.2113 4.45646C10.3592 4.61609 10.54 4.74164 10.7412 4.82441C10.9424 4.90718 11.1592 4.94518 11.3766 4.93579C11.594 4.92639 11.8067 4.86982 12 4.77L12.855 4.3425L13.68 5.1675L13.23 6C13.1342 6.19234 13.0808 6.40301 13.0735 6.61777C13.0662 6.83253 13.1051 7.04635 13.1875 7.24476C13.27 7.44318 13.3942 7.62155 13.5516 7.76781C13.7091 7.91407 13.8961 8.0248 14.1 8.0925L15 8.3925V9.585ZM9 6C8.40666 6 7.82664 6.17595 7.33329 6.50559C6.83994 6.83524 6.45543 7.30377 6.22836 7.85195C6.0013 8.40013 5.94189 9.00333 6.05765 9.58527C6.1734 10.1672 6.45912 10.7018 6.87868 11.1213C7.29824 11.5409 7.83279 11.8266 8.41473 11.9424C8.99667 12.0581 9.59987 11.9987 10.1481 11.7716C10.6962 11.5446 11.1648 11.1601 11.4944 10.6667C11.8241 10.1734 12 9.59335 12 9C12 8.20435 11.6839 7.44129 11.1213 6.87868C10.5587 6.31607 9.79565 6 9 6ZM9 10.5C8.70333 10.5 8.41332 10.412 8.16665 10.2472C7.91997 10.0824 7.72771 9.84812 7.61418 9.57403C7.50065 9.29994 7.47095 8.99834 7.52882 8.70737C7.5867 8.4164 7.72956 8.14912 7.93934 7.93934C8.14912 7.72956 8.4164 7.5867 8.70737 7.52882C8.99834 7.47095 9.29994 7.50065 9.57403 7.61418C9.84812 7.72771 10.0824 7.91997 10.2472 8.16665C10.412 8.41332 10.5 8.70333 10.5 9C10.5 9.39783 10.342 9.77936 10.0607 10.0607C9.77936 10.342 9.39783 10.5 9 10.5Z"
                  fill="#666666"
                />
              </svg>
            </MyButton>
          </div>
        </FormItemLayout>
        <FormItemLayout
          :label="
            newComplex.uniqueOffer.length === 0
              ? 'Главные УТП'
              : 'Второстепенные УТП'
          "
          v-for="utp in uniqueOffer"
          :key="'utp' + utp.id"
        >
          <MyInput
            :withLabel="false"
            v-model="utp.title"
            nameField="title"
            placeholder="Заголовок УТП"
          />
          <MyTextarea v-model="utp.description" placeholder="Описание УТП" />
          <div class="utp__btns">
            <MyButton class="utp__save" @click.prevent="saveUtp()">
              <svg
                width="18"
                height="18"
                viewBox="0 0 18 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15.5325 6.9675L11.0325 2.4675C10.9634 2.40004 10.8819 2.34656 10.7925 2.31C10.6995 2.27221 10.6004 2.25187 10.5 2.25H4.5C3.90326 2.25 3.33097 2.48705 2.90901 2.90901C2.48705 3.33097 2.25 3.90326 2.25 4.5V13.5C2.25 14.0967 2.48705 14.669 2.90901 15.091C3.33097 15.5129 3.90326 15.75 4.5 15.75H13.5C14.0967 15.75 14.669 15.5129 15.091 15.091C15.5129 14.669 15.75 14.0967 15.75 13.5V7.5C15.7506 7.4013 15.7317 7.30345 15.6943 7.21207C15.657 7.12069 15.602 7.03758 15.5325 6.9675ZM6.75 3.75H9.75V5.25H6.75V3.75ZM11.25 14.25H6.75V12C6.75 11.8011 6.82902 11.6103 6.96967 11.4697C7.11032 11.329 7.30109 11.25 7.5 11.25H10.5C10.6989 11.25 10.8897 11.329 11.0303 11.4697C11.171 11.6103 11.25 11.8011 11.25 12V14.25ZM14.25 13.5C14.25 13.6989 14.171 13.8897 14.0303 14.0303C13.8897 14.171 13.6989 14.25 13.5 14.25H12.75V12C12.75 11.4033 12.5129 10.831 12.091 10.409C11.669 9.98705 11.0967 9.75 10.5 9.75H7.5C6.90326 9.75 6.33097 9.98705 5.90901 10.409C5.48705 10.831 5.25 11.4033 5.25 12V14.25H4.5C4.30109 14.25 4.11032 14.171 3.96967 14.0303C3.82902 13.8897 3.75 13.6989 3.75 13.5V4.5C3.75 4.30109 3.82902 4.11032 3.96967 3.96967C4.11032 3.82902 4.30109 3.75 4.5 3.75H5.25V6C5.25 6.19891 5.32902 6.38968 5.46967 6.53033C5.61032 6.67098 5.80109 6.75 6 6.75H10.5C10.6989 6.75 10.8897 6.67098 11.0303 6.53033C11.171 6.38968 11.25 6.19891 11.25 6V4.8075L14.25 7.8075V13.5Z"
                  fill="white"
                />
              </svg>
              Сохранить
            </MyButton>
            <MyButton class="utp__clear" @click.prevent="clearUtp()">
              <svg
                width="18"
                height="18"
                viewBox="0 0 18 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M10.0575 9.00002L13.2825 5.78252C13.4237 5.64129 13.503 5.44974 13.503 5.25002C13.503 5.05029 13.4237 4.85874 13.2825 4.71752C13.1412 4.57629 12.9497 4.49695 12.75 4.49695C12.5502 4.49695 12.3587 4.57629 12.2175 4.71752L8.99995 7.94252L5.78245 4.71752C5.64123 4.57629 5.44968 4.49695 5.24995 4.49695C5.05023 4.49695 4.85868 4.57629 4.71745 4.71752C4.57623 4.85874 4.49689 5.05029 4.49689 5.25002C4.49689 5.44974 4.57623 5.64129 4.71745 5.78252L7.94245 9.00002L4.71745 12.2175C4.64716 12.2872 4.59136 12.3702 4.55329 12.4616C4.51521 12.553 4.49561 12.651 4.49561 12.75C4.49561 12.849 4.51521 12.9471 4.55329 13.0385C4.59136 13.1298 4.64716 13.2128 4.71745 13.2825C4.78718 13.3528 4.87013 13.4086 4.96152 13.4467C5.05292 13.4848 5.15095 13.5044 5.24995 13.5044C5.34896 13.5044 5.44699 13.4848 5.53839 13.4467C5.62978 13.4086 5.71273 13.3528 5.78245 13.2825L8.99995 10.0575L12.2175 13.2825C12.2872 13.3528 12.3701 13.4086 12.4615 13.4467C12.5529 13.4848 12.6509 13.5044 12.75 13.5044C12.849 13.5044 12.947 13.4848 13.0384 13.4467C13.1298 13.4086 13.2127 13.3528 13.2825 13.2825C13.3527 13.2128 13.4085 13.1298 13.4466 13.0385C13.4847 12.9471 13.5043 12.849 13.5043 12.75C13.5043 12.651 13.4847 12.553 13.4466 12.4616C13.4085 12.3702 13.3527 12.2872 13.2825 12.2175L10.0575 9.00002Z"
                  fill="#666666"
                />
              </svg>
            </MyButton>
          </div>
        </FormItemLayout>
        <FormItemLayout label="">
          <button
            class="addNewUTP"
            @click.prevent="addNewUTP()"
            v-if="
              newComplex.uniqueOffer.length > 0 &&
              newComplex.uniqueOffer.length < 2
            "
          >
            <svg
              width="18"
              height="18"
              viewBox="0 0 18 18"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M9 1.5C7.51664 1.5 6.0666 1.93987 4.83323 2.76398C3.59986 3.58809 2.63856 4.75943 2.07091 6.12987C1.50325 7.50032 1.35472 9.00832 1.64411 10.4632C1.9335 11.918 2.64781 13.2544 3.6967 14.3033C4.7456 15.3522 6.08197 16.0665 7.53683 16.3559C8.99168 16.6453 10.4997 16.4968 11.8701 15.9291C13.2406 15.3614 14.4119 14.4001 15.236 13.1668C16.0601 11.9334 16.5 10.4834 16.5 9C16.5 8.01509 16.306 7.03982 15.9291 6.12987C15.5522 5.21993 14.9997 4.39314 14.3033 3.6967C13.6069 3.00026 12.7801 2.44781 11.8701 2.0709C10.9602 1.69399 9.98492 1.5 9 1.5ZM9 15C7.81332 15 6.65328 14.6481 5.66658 13.9888C4.67989 13.3295 3.91085 12.3925 3.45673 11.2961C3.0026 10.1997 2.88378 8.99334 3.11529 7.82946C3.3468 6.66557 3.91825 5.59647 4.75736 4.75736C5.59648 3.91824 6.66558 3.3468 7.82946 3.11529C8.99335 2.88378 10.1997 3.0026 11.2961 3.45672C12.3925 3.91085 13.3295 4.67988 13.9888 5.66658C14.6481 6.65327 15 7.81331 15 9C15 10.5913 14.3679 12.1174 13.2426 13.2426C12.1174 14.3679 10.5913 15 9 15ZM12 8.25H9.75V6C9.75 5.80109 9.67099 5.61032 9.53033 5.46967C9.38968 5.32902 9.19892 5.25 9 5.25C8.80109 5.25 8.61033 5.32902 8.46967 5.46967C8.32902 5.61032 8.25 5.80109 8.25 6V8.25H6C5.80109 8.25 5.61033 8.32902 5.46967 8.46967C5.32902 8.61032 5.25 8.80109 5.25 9C5.25 9.19891 5.32902 9.38968 5.46967 9.53033C5.61033 9.67098 5.80109 9.75 6 9.75H8.25V12C8.25 12.1989 8.32902 12.3897 8.46967 12.5303C8.61033 12.671 8.80109 12.75 9 12.75C9.19892 12.75 9.38968 12.671 9.53033 12.5303C9.67099 12.3897 9.75 12.1989 9.75 12V9.75H12C12.1989 9.75 12.3897 9.67098 12.5303 9.53033C12.671 9.38968 12.75 9.19891 12.75 9C12.75 8.80109 12.671 8.61032 12.5303 8.46967C12.3897 8.32902 12.1989 8.25 12 8.25Z"
                fill="#4CAF50"
              />
            </svg>
            Добавить еще УТП
          </button>
        </FormItemLayout>
      </form>
    </template>
    <template v-slot:formBtns>
      <MyButton class="submit" @click.prevent="addNewComplex()"
        >Добавить</MyButton
      >
    </template>
  </FormLayout>
</template>

<script setup lang="ts">
import { TComplexNew, TUniqueOffer } from "@/app/types/complex";
import MyCheckbox from "@/shared/UI/MyCheckbox.vue";
import MyInput from "@/shared/UI/MyInput.vue";
import MySelect from "@/shared/UI/MySelect.vue";
import MyTextarea from "@/shared/UI/MyTextarea.vue";
import FormItemLayout from "@/shared/UI/formItemLayout.vue";
import FormLayout from "@/shared/UI/modalLayout.vue";
import MyButton from "@/shared/UI/MyButton.vue";
import { reactive, ref } from "vue";

const emits = defineEmits<{
  (e: "closeModel"): void;
}>();
defineProps<{
  isOpen: boolean;
}>();

const titleForm = ref<string>("Добавить комплекс");
const titleFromNewBuild = ref<boolean>(false);
const newComplex = reactive<TComplexNew>({
  type: "",
  idDomClick: "",
  country: "",
  region: "",
  address: "",
  metro: "",
  title: "",
  uniqueOffer: [],
});

let uniqueOffer = reactive<(TUniqueOffer & { id: number })[]>([
  {
    id: 0,
    title: "",
    description: "",
  },
]);

const addNewUTP = () => {
  uniqueOffer.push({
    id: newComplex.uniqueOffer.length,
    title: "",
    description: "",
  });
};

const saveUtp = () => {
  console.log(
    uniqueOffer[uniqueOffer.length - 1].title !== "" &&
      uniqueOffer[uniqueOffer.length - 1].description !== ""
  );
  if (
    uniqueOffer[uniqueOffer.length - 1].title !== "" &&
    uniqueOffer[uniqueOffer.length - 1].description !== ""
  ) {
    newComplex.uniqueOffer.push(uniqueOffer[uniqueOffer.length - 1]);

    uniqueOffer = [];
  }
};

const clearUtp = () => {
  if (
    uniqueOffer[uniqueOffer.length - 1].title !== "" &&
    uniqueOffer[uniqueOffer.length - 1].description
  ) {
    newComplex.uniqueOffer.push(uniqueOffer[uniqueOffer.length - 1]);
  }
};

const editUtp = (index: number) => {
  uniqueOffer = [];
  uniqueOffer.unshift({ id: index, ...newComplex.uniqueOffer[index] });
  newComplex.uniqueOffer.splice(index, 1);
};

const deleteUtp = (index: number) => {
  newComplex.uniqueOffer.splice(index, 1);
  uniqueOffer.push({
    id: newComplex.uniqueOffer.length,
    title: "",
    description: "",
  });
};

const addNewComplex = () => {
  console.log(3);
};
</script>

<style scoped lang="scss">
.addComplex {
  width: 100%;
  height: auto;
  &__form {
    width: 100%;
    height: auto;
    display: flex;
    flex-direction: column;
    justify-content: flex-start;
    align-items: flex-start;
    margin-top: 30px;
    row-gap: 20px;
    .form__item {
      width: 100%;
      height: auto;
    }
    .addNewUTP {
      display: flex;
      justify-content: flex-start;
      align-items: center;
      color: #333;
      font-size: 14px;

      svg {
        width: 18px;
        height: 18px;
        margin-right: 8px;
      }
    }
    .utp__btns {
      width: 100%;
      height: auto;
      display: flex;
      justify-content: flex-start;
      align-items: center;
      column-gap: 8px;

      .utp__save {
        @apply bg-green;
        @apply text-white;
        font-size: 14px;
      }
      .utp__clear {
        padding: 7px;
        border: 1px solid;
        @apply border-grey-400;
        svg {
          width: 18px;
          height: 18px;
        }
      }
    }
  }
  .submit {
    @apply bg-green;
    @apply text-white;
    margin-left: auto;
  }
}
</style>
